#include<iostream>
using namespace std;
int main() {
	//数组定义方式3种
	/*
	1、数据类型 数组名[数组长度];
	2、数据类型 数组名[数据长度]={值1，值2.....}
	3、数据类型 数组名[]={值1，值2，值3.....}*/

	//1、数据类型 数组名[数组长度];
	int arr[5];
	arr[0] = 10;//从0开始
	cout << arr[0] << endl;
	//2、数据类型 数组名[数据长度]={值1，值2.....}
	int arr1[3] = { 1,2,3 };//如果数据没全部填写完，会用0来填补剩下的数据
	cout << arr1[1] << endl;
	   //利用循环输出
	for (int i = 0; i <= 2; i++) {
		cout << arr1[i] << endl;
	   }
	//3、数据类型 数组名[]={值1，值2，值3.....}
	   //定义数组的时候必须有初始长度
	int arr2[] = {90,80,70,60,50,40,30,20,10};
	for (int i = 0; i < 9; i++) {
		cout << arr2[i] << endl;
	}
	system("pause");
	return 0;
}
